// About use 2~4KB memory

module.exports = {
    0: {
        n: '未知',
        z: '未知',
        l: ['未知']
    },
    1: {
        n: "北京",
        z: 'z1',
        l: ["北京", "海淀区", "朝阳区", "昌平区", "东城区", "西城区", "大兴区", "丰台区", "房山区", "延庆区", "门头沟区", "石景山区", "怀柔区", "密云区", "平谷区", "顺义区", "通州区"]
    },
    2: {
        n: "天津",
        z: 'z1',
        l: ["天津", "和平区", "南开区", "河西区", "河东区", "河北区", "红桥区"]
    },
    3: {
        n: "上海",
        z: 'z3',
        l: ["上海", "黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "虹口区", "杨浦区", "宝山区", "闵行区", "嘉定区", "浦东新区", "松江区", "金山区", "青浦区", "奉贤区", "崇明区"]
    },
    4: {
        n: "重庆",
        z: 'z4',
        l: ["重庆", "万州区", "黔江区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "渝北区", "巴南区", "长寿区", "江津区", "合川区", "永川区", "南川区", "綦江区", "大足区", "璧山区", "铜梁区", "潼南区", "荣昌区", "开州区", "梁平区", "武隆区"]
    },
    5: {
        n: "河北",
        z: 'z1',
        l: ["石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水"]
    },
    6: {
        n: "河南",
        z: 'z1',
        l: ["郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "商丘", "周口", "驻马店", "南阳", "信阳", "济源"]
    },
    7: {
        n: "山东",
        z: 'z0',
        l: ["济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "滨州", "德州", "聊城", "临沂", "菏泽"]
    },
    8: {
        n: "辽宁",
        z: 'z0',
        l: ["沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"]
    },
    9: {
        n: "吉林",
        z: 'z0',
        l: ["长春", "吉林", "四平", "通化", "白城", "辽源", "松原", "白山", "延边"]
    },
    10: {
        n: "黑龙江",
        z: 'z0',
        l: ["哈尔滨", "齐齐哈尔", "牡丹江", "佳木斯", "大庆", "双鸭山", "伊春", "七台河", "鹤岗", "黑河", "绥化", "大兴安岭", "鸡西"]
    },
    11: {
        n: "安徽",
        z: 'z3',
        l: ["合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "阜阳", "宿州", "滁州", "六安", "宣城", "池州", "亳州"]
    },
    12: {
        n: "云南",
        z: 'z4',
        l: ["昆明", "曲靖", "玉溪", "昭通", "保山", "丽江", "普洱", "临沧", "楚雄", "红河", "文山", "西双版纳", "大理", "德宏", "怒江", "迪庆"]
    },
    13: {
        n: "新疆",
        z: 'z7',
        l: ["乌鲁木齐", "克拉玛依", "吐鲁番", "哈密", "阿克苏", "喀什", "和田", "塔城", "阿勒泰", "伊犁", "博尔塔拉", "昌吉", "巴音郭楞", "克孜勒苏", "石河子", "图木舒克", "阿拉尔", "双河", "北屯", "胡杨河", "昆玉", "五家渠", "可克达拉", "铁门关"]
    },
    14: {
        n: "江苏",
        z: 'z3',
        l: ["南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港", "淮安", "盐城", "扬州", "镇江", "泰州", "宿迁"]
    },
    15: {
        n: "浙江",
        z: 'z3',
        l: ["杭州", "宁波", "温州", "绍兴", "湖州", "嘉兴", "金华", "衢州", "台州", "丽水", "舟山"]
    },
    16: {
        n: "江西",
        z: 'z5',
        l: ["南昌", "九江", "上饶", "抚州", "宜春", "吉安", "赣州", "景德镇", "萍乡", "新余", "鹰潭"]
    },
    17: {
        n: "湖北",
        z: 'z5',
        l: ["武汉", "黄石", "十堰", "宜昌", "襄阳", "鄂州", "荆门", "孝感", "荆州", "黄冈", "咸宁", "随州", "恩施", "仙桃", "神农架", "潜江", "天门"]
    },
    18: {
        n: "广西",
        z: 'z6',
        l: ["南宁", "柳州", "桂林", "梧州", "北海", "崇左", "来宾", "贺州", "玉林", "百色", "河池", "钦州", "防城港", "贵港"]
    },
    19: {
        n: "甘肃",
        z: 'z2',
        l: ["兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "张掖", "平凉", "酒泉", "庆阳", "定西", "陇南", "临夏", "甘南"]
    },
    20: {
        n: "山西",
        z: 'z2',
        l: ["太原", "大同", "朔州", "忻州", "阳泉", "吕梁", "晋中", "长治", "晋城", "临汾", "运城"]
    },
    21: {
        n: "内蒙古",
        z: 'z2',
        l: ["呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "兴安盟", "兴安", "锡林郭勒盟", "锡林郭勒", "阿拉善盟", "阿拉善"]
    },
    22: {
        n: "陕西",
        z: 'z2',
        l: ["西安", "宝鸡", "咸阳", "铜川", "渭南", "延安", "榆林", "汉中", "安康", "商洛"]
    },
    23: {
        n: "湖南",
        z: 'z5',
        l: ["长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "娄底", "郴州", "永州", "怀化", "湘西"]
    },
    24: {
        n: "福建",
        z: 'z5',
        l: ["福州", "厦门", "漳州", "泉州", "三明", "莆田", "南平", "龙岩", "宁德", "金门", "连江"]
    },
    25: {
        n: "贵州",
        z: 'z4',
        l: ["贵阳", "遵义", "六盘水", "安顺", "毕节", "铜仁", "黔东南", "黔南", "黔西南"]
    },
    26: {
        n: "广东",
        z: 'z6',
        l: ["广州", "韶关", "深圳", "珠海", "汕头", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮"]
    },
    27: {
        n: "青海",
        z: 'z7',
        l: ["西宁", "海东", "海北", "海西", "黄南", "果洛", "玉树"]
    },
    28: {
        n: "西藏",
        z: 'z7',
        l: ["拉萨", "日喀则", "昌都", "林芝", "山南", "那曲", "阿里"]
    },
    29: {
        n: "四川",
        z: 'z4',
        l: ["成都", "绵阳", "自贡", "攀枝花", "泸州", "德阳", "广元", "遂宁", "内江", "乐山", "资阳", "宜宾", "南充", "达州", "雅安", "广安", "巴中", "眉山", "阿坝", "甘孜", "凉山"]
    },
    30: {
        n: "宁夏",
        z: 'z2',
        l: ["银川", "石嘴山", "吴忠", "固原", "中卫"]
    },
    31: {
        n: "海南",
        z: 'z6',
        l: ["海口", "三亚", "儋州", "五指山", "文昌", "琼海", "万宁", "东方", "澄迈", "临高", "定安", "屯昌", "白沙", "昌江", "乐东", "陵水", "保亭", "琼中"]
    },
    32: {
        n: "台湾",
        z: 'z8',
        l: ["台北", "新北", "桃园", "台中", "台南", "台东", "高雄", "基隆", "新竹", "嘉义", "台北市", "花莲", "宜兰", "彰化", "云林", "南投", "苗栗", "屏东", "澎湖"]
    },
    33: {
        n: "香港",
        z: 'z8',
        l: ["香港", "九龙", "新界", "香港岛"]
    },
    34: {
        n: "澳门",
        z: 'z8',
        l: ["澳门半岛", "氹仔岛", "路环岛"]
    }
};
